# ConnectorSeparator Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSettings..::..ConnectorSeparator Property
ConduitSettings Class See Also
---
The conduit connector separator string.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string ConnectorSeparator { get; set; }
```

Visual Basic
---
```text
Public Property ConnectorSeparator As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ConnectorSeparator {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ConduitSettings Class
Autodesk.Revit.DB.Electrical Namespace